In [1]:
#Importing libraries
import pandas as pd

In [2]:
#Loading dataset
df = pd.read_csv('mode.csv')

In [3]:
#Printing top 5 rows
df.head()

   Student  Overall Marks Gender    Subject
0    Anish             97   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

## Mode

* It is the number which occurs most frequently in the data series.<br><br>

* It is robust and is not generally affected much by addition of a couple of new values.

In [4]:
#Calculating mode of 'Gender' column
mode = df['Gender'].mode()
print(mode)

0    Male
dtype: object

In [5]:
#Calculating mode of 'Subject column'
mode = df['Subject'].mode()
print(mode)

0    Chemistry
dtype: object

## Mean

* It is often called as average.

In [6]:
#Calculating mean of 'Overall Marks' column
mean = df['Overall Marks'].mean()
print(mean)

68.21

In [7]:
#read a new file 'mean_robust.csv' which has 10000 value added at bottom of the file
df = pd.read_csv('mean_robust.csv')

In [8]:
#Viewing first 5 rows
df.head()

   Student  Overall Marks Gender    Subject
0    Anish             97   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

In [9]:
#Calculating mean of 'Overall Marks' column
mean = df['Overall Marks'].mean()
print(mean)

166.54455445544554

## Median

It is nothing but the absolute central value of the data.

In [10]:
#Reading a data
df = pd.read_csv('median.csv')

In [11]:
#Viewing a dataset
df.head()

   Student  Overall Marks Gender    Subject
0    Anish           9700   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

In [12]:
#Calculating median
median = df['Overall Marks'].median()
print(median)

77.0

In [13]:
#Calculating Quantiles. Remember Quantiles are 1/4th of Quartiles.
minimum = df['Overall Marks'].quantile(0)  # It returns minimum value of a range
Q1 = df['Overall Marks'].quantile(0.25)
Q2 = df['Overall Marks'].quantile(0.5)    #It returns a median value of a range
Q3 = df['Overall Marks'].quantile(0.75)
Q4 = df['Overall Marks'].quantile(1)
print(minimum)

0.0

In [14]:
print("First Quartile : ", Q1)
print("Second Quartile : ", Q2)
print("Third Quartile : ", Q3)
print("Fourth Quartile : ", Q4)

First Quartile :  57.25
Second Quartile :  77.0
Third Quartile :  87.25
Fourth Quartile :  9700.0

## Range and IQR

* **Range :** The difference between smallest and largest values.<br><br>
* **IQR :** The difference between third 3rd quartile and 1st quartile.<br><br>
* The bigger the range the more spread out is the data.<br><br>
* Range is Susceptible to outliers<br><br>
* IQR is robust to outliers.

In [15]:
#Calculating min and max
max_data = df['Overall Marks'].max()
min_data = df['Overall Marks'].min()

In [16]:
#Calculating range
range = max_data - min_data
print(range)

9700

In [17]:
#Calculating IQR(Inter Quartile Range)
IQR = Q3 - Q1
print(IQR)

30.0